{
    "resume": [
        {
            "title": "Summary",
            "description": "I am a passionate web developer focused on building dynamic, user-centric applications. My journey in web development is driven by a fascination with technology's ability to solve real-world problems. I thrive on challenges and enjoy the process of creating applications that enhance user experiences.",
            "bulletPoints": [
                "Pokhara, Kaski, Gandaki, Nepal",
                "+977 9819113548, 9745994819",
                "timilsinasagar04@gmail.com",
                "https://sagartimilsina.com.np/"
            ]
        },
        {
            "title": "Professional Experience",
            "description": "I have gained practical experience through internships and projects.",
            "jobs": [
                {
                    "jobTitle": "Junior Web Developer in PHP and Laravel",
                    "company": "Tuki Soft Pvt. Ltd.",
                    "date": "2024/02/19 - Present",
                    "location": "Sundar Marg 9, Pokhara, Nepal",
                    "bulletPoints": [
                        "Developed web applications using PHP and Laravel for various sectors, including hotels, government, corporate, consultancy, and CRM.",
                        "Collaborated with the design team to implement responsive UI, ensuring cross-platform compatibility.",
                        "Contributed to the development of a Learning Management System (LMS), enhancing e-learning experiences.",
                        "Integrated external APIs such as Bunny Net for video streaming and Stripe for payment gateways.",
                        "Worked on Zoom API integration for communication features within the web applications.",
                        "Participated in code reviews and debugging sessions, ensuring code quality and adherence to best practices.",
                        "Worked closely with cross-functional teams to deliver projects on time while maintaining client satisfaction.",
                        "Guided interns through coding best practices, emphasizing clean, efficient, and secure code.",
                        "Provided QA testing support, ensuring bug-free applications by identifying issues and implementing fixes in collaboration with the testing team.",
                        "Assisted in creating and reviewing security audit reports for government websites, ensuring compliance with security standards and identifying vulnerabilities."
                    ]
                },
                {
                    "jobTitle": "Full Stack Web Developer in PHP Laravel (Intern)",
                    "company": "XDezo Academy",
                    "date": "July 2023 - Jan 2024",
                    "location": "XDezo Technology, Ratna Chowk, Pokhara-7, Pokhara 33700, Nepal",
                    "bulletPoints": [
                        "Collaborated with a team of four developers to design and develop custom websites.",
                        "Worked on three major projects, contributing to both frontend and backend development.",
                        "Developed responsive UI using HTML, CSS, and JavaScript, ensuring user-friendly interfaces.",
                        "Utilized PHP and Laravel for backend development, building efficient and scalable web applications.",
                        "Participated in code competitions and  workshops, ensuring code quality and adherence to best practices."
                    ]
                },
                {
                    "jobTitle": "Operation Lead and College Representative (CR)",
                    "company": "Code for Change Pokhara",
                    "date": "2022 - 2024",
                    "location": "Pokhara, Nepal",
                    "bulletPoints": [
                        "Served as College Representative (CR) for Code for Change Pokhara (2022-2023), helping with community engagement, event organization, and communication between the organization and  students.",
                        "Assisted in the recruitment of new members and facilitated onboarding and orientation for newcomers.",
                        "Organized and participated in events, ensuring smooth execution and fostering student involvement.",
                        "Transitioned to Operations Lead (2023-2024), overseeing the planning and execution of major events, workshops, and initiatives.",
                        "Coordinated cross-functional teams to ensure timely project delivery while maintaining high-quality standards.",
                        "Led communication efforts across teams, ensuring alignment with the organization's mission and objectives.",
                        "Managed logistics and resources for events, including managing registrations, ensuring effective outreach, and evaluating event outcomes.",
                        "Contributed to reports, documentation, and feedback collection to improve future operations and events."
                    ]
                }
            ]
        },
        {
            "title": "Education",
            "degrees": [
                {
                    "subtitle": "Bachelor in Computer Science and Information Technology (B.Sc.CSIT)",
                    "description": "Currently pursuing a Bachelor's degree in B.Sc. CSIT at Prithvi Narayan Campus",
                    "date": "April 2021 - Present",
                    "location": "Bagar 1, Pokhara, Kaski, Gandaki, Nepal",
                    "bulletPoints": []
                },
                {
                    "subtitle": "+2 in Science (SLC)",
                    "description": "Completed my high school education with a strong focus on science and mathematics.",
                    "date": "August 2017 - July 2019",
                    "location": "Pokhara, Kaski, Gandaki, Nepal",
                    "bulletPoints": [
                        "Achieved excellent grades in science and mathematics subjects.",
                        "Participated in extracurricular activities.",
                        "Developed critical thinking and analytical skills through various projects."
                    ]
                },
                {
                    "subtitle": "SEE",
                    "description": "Completed my Secondary Education Examination (SEE).",
                    "date": "April 2004 - July 2017",
                    "location": "Pokhara, Kaski, Gandaki, Nepal",
                    "bulletPoints": [
                        "Achieved excellent grades in all subjects.",
                        "Participated in school clubs and extracurricular activities."
                    ]
                }
            ]
        }
    ]
}